configuration/src/Documents/ОтсутствияНаРабочемМесте/ОтсутствияНаРабочемМесте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтсутствияНаРабочемМесте</name>
  <registerRecords>InformationRegister.ОтсутствияСотрудниковНаРабочемМесте</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДатыОтсутствияСотрудников</name>
    <attributes>
      <name>ДатаОтсутствия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Documents/ОтсутствияНаРабочемМесте/Forms/ЗаписьОбОтсутствии/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЭтоНоваяЗапись Тогда
		Заголовок = "Добавление записи";
	Иначе
		Заголовок = "Изменение записи";
	КонецЕсли;
	
	Элементы.УдалитьЗапись.Видимость = НЕ Параметры.ЭтоНоваяЗапись;
	
	Сотрудник = Параметры.Сотрудник;
	ДатаОтсутствия = Параметры.ДатаОтсутствия;
	Комментарий = Параметры.Комментарий;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	
	ЗакрытьОкно(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	ЗакрытьОкно(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьОкно(Знач ДобавитьЗапись)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Сотрудник", Сотрудник);
	ПараметрыЗакрытия.Вставить("ДатаОтсутствия", ДатаОтсутствия);
	ПараметрыЗакрытия.Вставить("Комментарий", Комментарий);
	ПараметрыЗакрытия.Вставить("ДобавитьЗапись", ДобавитьЗапись);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти
